#include "Renderer.hpp"
#include "VulkanRenderer.hpp"

#include "Storage/Slotmap.h"
#include "Program.h"

#include "ShaderCompiler.h"

#include "Math.inl"

#include "imgui.h"
#include "implot/implot.h"

using namespace BB;

struct RenderFence
{
	uint64_t next_fence_value;
	uint64_t last_complete_value;
	RFence fence;
};

constexpr uint32_t MAX_TEXTURES = 1024;
constexpr const char* DEBUG_TEXTURE_NAME = "debug texture";

class GPUTextureManager
{
public:
	struct TextureSlot
	{
		const char* name;
		RImage image;
		RImageView view;
		uint32_t next_free;
	};

	void Init(const RCommandList a_list, UploadBufferView& a_upload_view);

	const RTexture UploadTexture(const RCommandList a_list, const UploadImageInfo& a_upload_info, UploadBufferView& a_upload_buffer);
	void FreeTexture(const RTexture a_texture);

	const TextureSlot& GetTextureSlot(const RTexture a_texture)
	{
		return m_textures[a_texture.handle];
	}

	void DisplayTextureListImgui()
	{
		//if (!g_ShowEditor)
		//	return;

		if (ImGui::CollapsingHeader("Texture Manager"))
		{
			ImGui::Indent();
			if (ImGui::CollapsingHeader("next free image slot"))
			{
				ImGui::Indent();
				ImGui::Text("Texture slot index: %u", m_next_free);
				const ImVec2 image_size = { 160, 160 };
				ImGui::Image(m_next_free, image_size);
				ImGui::Unindent();
			}

			for (uint32_t i = 0; i < MAX_TEXTURES; i++)
			{
				const TextureSlot& slot = m_textures[i];

				if (ImGui::TreeNodeEx(reinterpret_cast<void*>(i), ImGuiTreeNodeFlags_CollapsingHeader, "Texture Slot: %u", i))
				{
					ImGui::Indent();
					if (slot.name != nullptr)
						ImGui::TextUnformatted(slot.name);
					else
						ImGui::Text("UNNAMED! This might be an error");
					const ImVec2 image_size = { 160, 160 };
					ImGui::Image(i, image_size);
					ImGui::Unindent();
				}
			}
			ImGui::Unindent();
		}
	}

private:
	uint32_t m_next_free;
	TextureSlot m_textures[MAX_TEXTURES];
	BBRWLock m_lock;

	//purple color
	struct DebugTexture
	{
		RImage img;
		RImageView view;
	} m_debug_texture;
};

namespace BB
{
	/// <summary>
	/// Handles one large upload buffer and handles it as if it's seperate buffers by handling chunks.
	/// </summary>
	class UploadBufferPool
	{
	public:
		UploadBufferPool(MemoryArena& a_arena, const size_t a_size_per_pool, const uint32_t a_pool_count)
			: m_upload_view_count(a_pool_count)
		{
			const size_t upload_buffer_size = a_size_per_pool * m_upload_view_count;
			BB_ASSERT(upload_buffer_size < UINT32_MAX, "we use uint32_t for offset and size but the uploadbuffer size is bigger then UINT32_MAX");

			GPUBufferCreateInfo buffer_info;
			buffer_info.type = BUFFER_TYPE::UPLOAD;
			buffer_info.size = upload_buffer_size;
			buffer_info.host_writable = true;
			buffer_info.name = "upload_buffer_pool";
			m_upload_buffer = Vulkan::CreateBuffer(buffer_info);
			m_upload_mem_start = Vulkan::MapBufferMemory(m_upload_buffer);

			m_views = ArenaAllocArr(a_arena, UploadBufferView, m_upload_view_count);
			for (uint32_t i = 0; i < m_upload_view_count; i++)
			{
				m_views[i].upload_buffer_handle = m_upload_buffer;
				m_views[i].size = static_cast<uint32_t>(a_size_per_pool);
				m_views[i].offset = static_cast<uint32_t>(i * a_size_per_pool);
				m_views[i].used = 0;
				m_views[i].pool_index = i;
				m_views[i].view_mem_start = Pointer::Add(m_upload_mem_start, m_views[i].offset);
				m_views[i].fence_value = 0;
			}

			for (uint32_t i = 0; i < m_upload_view_count - 1; i++)
			{
				m_views[i].next = &m_views[i + 1];
			}

			m_free_views = m_views;
			m_in_flight_views = nullptr;
			m_lock = OSCreateRWLock();
			m_in_flight_lock = OSCreateRWLock();

			m_fence = Vulkan::CreateFence(0, "upload buffer fence");
			m_last_completed_fence_value = 0;
			m_next_fence_value = 1;
		}
		~UploadBufferPool()
		{
			Vulkan::UnmapBufferMemory(m_upload_buffer);
			Vulkan::FreeBuffer(m_upload_buffer);
		}

		UploadBufferView& GetUploadView(const size_t a_upload_size)
		{
			(void)a_upload_size; //not used yet.
			OSAcquireSRWLockWrite(&m_lock);
			UploadBufferView& view = *m_free_views.Pop();
			//TODO, handle nullptr, maybe just wait or do the reset here?
			OSReleaseSRWLockWrite(&m_lock);
			return view;
		}

		void IncrementNextFenceValue()
		{
			//yes
			//maybe a lock is faster as it can be uncontested. Which may often be the case.
			BBInterlockedIncrement64(reinterpret_cast<volatile long long*>(&m_next_fence_value));
		}

		void GetFence(RFence& a_fence, uint64_t& a_next_fence_value)
		{
			a_fence = m_fence;
			a_next_fence_value = m_next_fence_value;
		}

		//return a upload view and set the fence value to the next fence value.
		void ReturnUploadViews(const BB::Slice<UploadBufferView> a_views, RFence& a_out_fence, uint64_t& a_out_next_fence_value)
		{
			OSAcquireSRWLockWrite(&m_in_flight_lock);
			for (size_t i = 0; i < a_views.size(); i++)
			{
				a_views[i].fence_value = m_next_fence_value;
				m_in_flight_views.Push(&m_views[a_views[i].pool_index]);
			}
			a_out_fence = m_fence;
			a_out_next_fence_value = m_next_fence_value;
			OSReleaseSRWLockWrite(&m_in_flight_lock);
		}

		void CheckIfInFlightDone()
		{
			LinkedList<UploadBufferView> local_view_free{};

			//lock as a write can be attempetd in m_in_flight_pools.
			OSAcquireSRWLockWrite(&m_in_flight_lock);
			m_last_completed_fence_value = Vulkan::GetCurrentFenceValue(m_fence);

			//Thank you Descent Raytracer teammates for the great code that I can steal
			for (UploadBufferView** in_flight_views = &m_in_flight_views.head; *in_flight_views;)
			{
				UploadBufferView* view = *in_flight_views;

				if (view->fence_value <= m_last_completed_fence_value)
				{
					//Get next in-flight commandlist
					*in_flight_views = view->next;
					local_view_free.Push(view);
				}
				else
				{
					in_flight_views = &view->next;
				}
			}

			if (local_view_free.HasEntry())
				m_free_views.MergeList(local_view_free);

			OSReleaseSRWLockWrite(&m_in_flight_lock);
		}

	private:
		GPUBuffer m_upload_buffer;			  //8
		void* m_upload_mem_start;			  //16

		UploadBufferView* m_views;			  //24
		LinkedList<UploadBufferView> m_free_views;		 //32
		LinkedList<UploadBufferView> m_in_flight_views;  //40
		BBRWLock m_in_flight_lock;		      //48
		BBRWLock m_lock;					  //56

		//this fence should be send to all execute commandlists when they include a upload buffer from here.
		RFence m_fence;						  //64
		volatile uint64_t m_next_fence_value; //72
		uint64_t m_last_completed_fence_value;//80

		const uint32_t m_upload_view_count;	  //84
	};
}

RCommandList CommandPool::StartCommandList(const char* a_name)
{
	BB_ASSERT(m_recording == false, "already recording a commandlist from this commandpool!");
	BB_ASSERT(m_list_current_free < m_list_count, "command pool out of lists!");
	RCommandList list{ m_lists[m_list_current_free++] };
	Vulkan::StartCommandList(list, a_name);
	m_recording = true;
	return list;
}

void CommandPool::EndCommandList(RCommandList a_list)
{
	BB_ASSERT(m_recording == true, "trying to end a commandlist while the pool is not recording any list");
	BB_ASSERT(a_list == m_lists[m_list_current_free - 1], "commandlist that was submitted is not from this pool or was already closed!");
	Vulkan::EndCommandList(a_list);
	m_recording = false;
}
void CommandPool::ResetPool()
{
	BB_ASSERT(m_recording == false, "trying to reset a pool while still recording");
	Vulkan::ResetCommandPool(m_api_cmd_pool);
	m_list_current_free = 0;
}

//THREAD SAFE: TRUE
class BB::RenderQueue
{
public:

	RenderQueue(MemoryArena& a_arena, const QUEUE_TYPE a_queue_type, const char* a_name, const uint32_t a_command_pool_count, const uint32_t a_command_lists_per_pool)
		:	m_pool_count(a_command_pool_count)
	{
		m_queue_type = a_queue_type;
		m_queue = Vulkan::GetQueue(a_queue_type, a_name);
		m_fence.fence = Vulkan::CreateFence(0, "make_it_queue_name_sam!!!");
		m_fence.last_complete_value = 0;
		m_fence.next_fence_value = 1;

		m_pools = ArenaAllocArr(a_arena, CommandPool, a_command_pool_count);
		for (uint32_t i = 0; i < a_command_pool_count; i++)
		{
			m_pools[i].pool_index = i;
			m_pools[i].m_recording = false;
			m_pools[i].m_fence_value = 0;
			m_pools[i].m_list_count = a_command_lists_per_pool;
			m_pools[i].m_list_current_free = 0;
			m_pools[i].m_lists = ArenaAllocArr(a_arena, RCommandList, m_pools[i].m_list_count);
			Vulkan::CreateCommandPool(a_queue_type, a_command_lists_per_pool, m_pools[i].m_api_cmd_pool, m_pools[i].m_lists);
		}

		for (uint32_t i = 0; i < a_command_pool_count - 1; i++)
		{
			m_pools[i].next = &m_pools[i + 1];
		}

		m_pools[a_command_pool_count - 1].next = nullptr;
		m_free_pools = &m_pools[0];
		m_lock = OSCreateRWLock();
		m_in_flight_lock = OSCreateRWLock();
	}
	~RenderQueue()
	{
		WaitIdle();
		Vulkan::FreeFence(m_fence.fence);
		for (uint32_t i = 0; i < m_pool_count; i++)
		{
			Vulkan::FreeCommandPool(m_pools[i].m_api_cmd_pool);
		}
	}

	CommandPool& GetCommandPool(const char* a_pool_name = "")
	{
		(void)a_pool_name; //not used yet.
		OSAcquireSRWLockWrite(&m_lock);
		CommandPool& pool = *m_free_pools.Pop();
		//TODO, handle nullptr, maybe just wait or do the reset here?
		OSReleaseSRWLockWrite(&m_lock);
		return pool;
	}

	void ReturnPool(CommandPool& a_pool)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		a_pool.m_fence_value = m_fence.next_fence_value;
		m_in_flight_pools.Push(&m_pools[a_pool.pool_index]);
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ReturnPools(const Slice<CommandPool> a_pools)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		for (size_t i = 0; i < a_pools.size(); i++)
		{
			a_pools[i].m_fence_value = m_fence.next_fence_value;
			m_in_flight_pools.Push(&m_pools[a_pools[i].pool_index]);
		}

		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ExecuteCommands(RCommandList* a_lists, const uint32_t a_list_count, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = a_list_count;
		execute_info.signal_fences = a_signal_fences;
		execute_info.signal_values = a_signal_values;
		execute_info.signal_count = a_signal_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		Vulkan::ExecuteCommandLists(m_queue, &execute_info, 1);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
	}

	void ExecutePresentCommands(const RCommandList a_list, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count, const uint32_t a_backbuffer_index)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");
		
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = &a_list;
		execute_info.list_count = 1;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		Vulkan::ExecutePresentCommandList(m_queue, execute_info, a_backbuffer_index);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
	}

	//void ExecutePresentCommands(CommandList* a_CommandLists, const uint32_t a_CommandListCount, const RenderFence* a_WaitFences, const PIPELINE_STAGE* a_WaitStages, const uint32_t a_FenceCount);
	void WaitFenceValue(const uint64_t a_fence_value)
	{
		LinkedList<CommandPool> local_list_free;

		Vulkan::WaitFence(m_fence.fence, a_fence_value);

		//lock as a write can be attempetd in m_in_flight_pools.
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		//Thank you Descent Raytracer teammates great code that I can steal
		for (CommandPool** in_flight_command_polls = &m_in_flight_pools.head; *in_flight_command_polls;)
		{
			CommandPool* command_pool = *in_flight_command_polls;

			if (command_pool->m_fence_value <= a_fence_value)
			{
				command_pool->ResetPool();

				//Get next in-flight commandlist
				*in_flight_command_polls = command_pool->next;
				local_list_free.Push(command_pool);
			}
			else
			{
				in_flight_command_polls = &command_pool->next;
			}
		}

		if (local_list_free.HasEntry())
			m_free_pools.MergeList(local_list_free);

		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void WaitIdle()
	{
		WaitFenceValue(m_fence.next_fence_value - 1);
	}

	RenderFence GetFence() const { return m_fence; }
	uint64_t GetNextFenceValue() const { return m_fence.next_fence_value; }
	uint64_t GetLastCompletedValue() const { return m_fence.last_complete_value; }

private:
	QUEUE_TYPE m_queue_type; //4
	BBRWLock m_lock; //12
	const uint32_t m_pool_count; //16
	CommandPool* m_pools; //24
	LinkedList<CommandPool> m_free_pools; //32 
	LinkedList<CommandPool> m_in_flight_pools; //40
	BBRWLock m_in_flight_lock; //48

	RQueue m_queue;//56 
	RenderFence m_fence; //80
};

struct Mesh
{
	GPUBufferView vertex_buffer;
	GPUBufferView index_buffer;
};

struct ShaderEffect
{
	const char* name;				//8
	ShaderObject shader_object;		//16
	RPipelineLayout pipeline_layout;//24
	SHADER_STAGE shader_stage;		//28
	SHADER_STAGE_FLAGS shader_stages_next; //32

#ifdef _ENABLE_REBUILD_SHADERS
	const char* shader_entry;
	const char* shader_path;
	ShaderObjectCreateInfo create_info;
#endif // _ENABLE_REBUILD_SHADERS
};

struct Material
{
	struct Shader
	{
		RPipelineLayout pipeline_layout;
		
		ShaderObject shader_objects[UNIQUE_SHADER_STAGE_COUNT];
		SHADER_STAGE shader_stages[UNIQUE_SHADER_STAGE_COUNT];
		uint32_t shader_effect_count;
	} shader;


	RTexture base_color;
	RTexture normal_texture;
};

struct MeshDrawCall
{
	MeshHandle mesh;
	MaterialHandle material;
	uint32_t index_start;
	uint32_t index_count;
};

struct DrawList
{
	MeshDrawCall* mesh_draw_call;
	ShaderTransform* transform;
};

union Light
{
	PointLight point_light;
};

constexpr uint32_t UPLOAD_BUFFER_POOL_SIZE = mbSize * 8;
constexpr uint32_t UPLOAD_BUFFER_POOL_COUNT = 8;
constexpr uint32_t BACK_BUFFER_MAX = 3;

constexpr size_t LIGHT_MAX = 128;

struct RenderPass3D
{
	struct Frame
	{
		GPUBuffer per_frame_buffer;
		size_t per_frame_buffer_size;

		struct PerFrameBufferPart
		{
			uint32_t offset;
			uint32_t size;
		};
		PerFrameBufferPart scene_buffer;
		PerFrameBufferPart transform_buffer;
		PerFrameBufferPart light_buffer;
		DescriptorAllocation desc_alloc;
		uint64_t fence_value;
		RTexture back_buffer_image;
	};
	Frame* frames;
	Scene3DInfo scene_info;

	RDescriptorLayout descriptor_layout;

	RImage depth_image;
	RImageView depth_image_view;

	uint32_t draw_list_count;
	uint32_t draw_list_max;
	DrawList draw_list_data;

	StaticSlotmap<PointLight, LightHandle> light_container;
};

struct RenderInterface_inst
{
	RenderInterface_inst(MemoryArena& a_arena)
		: graphics_queue(a_arena, QUEUE_TYPE::GRAPHICS, "graphics queue", 8, 8),
		upload_buffers(a_arena, UPLOAD_BUFFER_POOL_SIZE, UPLOAD_BUFFER_POOL_COUNT)
	{}

	RenderIO render_io;
	bool debug;

	ShaderCompiler shader_compiler;

	RenderQueue graphics_queue;
	UploadBufferPool upload_buffers;
	GPUTextureManager texture_manager;

	RTexture white;
	RTexture black;

	RDescriptorLayout static_sampler_descriptor_set;
	RDescriptorLayout global_descriptor_set;
	DescriptorAllocation global_descriptor_allocation;

	struct VertexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
	} vertex_buffer;
	struct CPUVertexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
		void* start_mapped;
	} cpu_vertex_buffer;

	struct IndexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
	} index_buffer;
	struct CPUIndexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
		void* start_mapped;
	} cpu_index_buffer;


	RenderPass3D renderpass_3d;

	StaticSlotmap<Mesh, MeshHandle> mesh_map{};
	StaticSlotmap<ShaderEffect, ShaderEffectHandle> shader_effect_map{};
	StaticSlotmap<Material, MaterialHandle> material_map{};
};

static RenderInterface_inst* s_render_inst;
static RenderPass3D& GetRenderPass3D()
{
	return s_render_inst->renderpass_3d;
}

namespace IMGUI_IMPL
{
	constexpr size_t INITIAL_VERTEX_SIZE = sizeof(Vertex2D) * 128;
	constexpr size_t INITIAL_INDEX_SIZE = sizeof(uint32_t) * 256;

	struct ImRenderBuffer
	{
		WriteableGPUBufferView vertex_buffer;
		WriteableGPUBufferView index_buffer;
	};

	constexpr SHADER_STAGE IMGUI_SHADER_STAGES[2]{ SHADER_STAGE::VERTEX, SHADER_STAGE::FRAGMENT_PIXEL };

	struct ImRenderData
	{
		// 0 = VERTEX, 1 = FRAGMENT
		ShaderEffectHandle		shader_effects[2];	//16
		RTexture				font_image;         //20

		// Render buffers for main window
		uint32_t frame_index;                       //24
		ImRenderBuffer* frame_buffers;				//32

		//we just fetch em directly
		const ShaderEffect* vertex;
		const ShaderEffect* fragment;
	};

	inline static ImRenderData* ImGetRenderData()
	{
		return ImGui::GetCurrentContext() ? reinterpret_cast<ImRenderData*>(ImGui::GetIO().BackendRendererUserData) : nullptr;
	}

	inline static void ImSetRenderState(const ImDrawData& a_draw_data, const RCommandList a_cmd_list, const ImRenderBuffer& a_rb, const uint32_t a_vert_pos)
	{
		ImRenderData* bd = ImGetRenderData();

		{
			const ShaderObject shader_objects[2]{ bd->vertex->shader_object, bd->fragment->shader_object };
			Vulkan::BindShaders(a_cmd_list, _countof(IMGUI_SHADER_STAGES), IMGUI_SHADER_STAGES, shader_objects);
		}

		// Setup scale and translation:
		// Our visible imgui space lies from draw_data->DisplayPps (top left) to draw_data->DisplayPos+data_data->DisplaySize (bottom right). DisplayPos is (0,0) for single viewport apps.
		{
			ShaderIndices2D shader_indices;
