#include "Renderer.hpp"
#include "VulkanRenderer.hpp"

#include "Storage/Slotmap.h"
#include "Program.h"

#include "ShaderCompiler.h"

#include "Math.inl"

using namespace BB;

struct RenderFence
{
	uint64_t next_fence_value;
	uint64_t last_complete_value;
	RFence fence;
};

constexpr uint32_t MAX_TEXTURES = 1024;

class GPUTextureManager
{
public:
	GPUTextureManager();

	const RTexture UploadTexture(const UploadImageInfo& a_upload_info, const RCommandList a_list, UploadBufferView& a_upload_buffer);
	void FreeTexture(const RTexture a_texture);

private:
	struct TextureSlot
	{
		RImage image;
		RImageView view;
		uint32_t next_free;
	};

	uint32_t next_free;
	TextureSlot textures[MAX_TEXTURES];
	BBRWLock lock;

	//purple color
	RImage debug_texture;
};

namespace BB
{
	/// <summary>
	/// Handles one large upload buffer and handles it as if it's seperate buffers by handling chunks.
	/// </summary>
	class UploadBufferPool
	{
	public:
		UploadBufferPool(Allocator a_sys_allocator, const size_t a_size_per_pool, const uint32_t a_pool_count)
			: m_upload_view_count(a_pool_count)
		{
			const size_t upload_buffer_size = a_size_per_pool * m_upload_view_count;
			BB_ASSERT(upload_buffer_size < UINT32_MAX, "we use uint32_t for offset and size but the uploadbuffer size is bigger then UINT32_MAX");

			BufferCreateInfo buffer_info;
			buffer_info.type = BUFFER_TYPE::UPLOAD;
			buffer_info.size = upload_buffer_size;
			buffer_info.host_writable = true;
			buffer_info.name = "upload_buffer_pool";
			m_upload_buffer = Vulkan::CreateBuffer(buffer_info);
			m_upload_mem_start = Vulkan::MapBufferMemory(m_upload_buffer);

			m_views = BBnewArr(a_sys_allocator, m_upload_view_count, UploadBufferView);
			for (uint32_t i = 0; i < m_upload_view_count; i++)
			{
				m_views[i].upload_buffer_handle = m_upload_buffer;
				m_views[i].size = static_cast<uint32_t>(a_size_per_pool);
				m_views[i].offset = static_cast<uint32_t>(i * a_size_per_pool);
				m_views[i].used = 0;
				m_views[i].pool_index = i;
				m_views[i].view_mem_start = Pointer::Add(m_upload_mem_start, m_views[i].offset);
				m_views[i].fence_value = 0;
			}

			for (uint32_t i = 0; i < m_upload_view_count - 1; i++)
			{
				m_views[i].next = &m_views[i + 1];
			}

			m_free_views = m_views;
			m_in_flight_views = nullptr;
			m_lock = OSCreateRWLock();
			m_in_flight_lock = OSCreateRWLock();

			m_fence = Vulkan::CreateFence(0, "upload buffer fence");
			m_last_completed_fence_value = 0;
			m_next_fence_value = 1;
		}
		~UploadBufferPool()
		{
			Vulkan::UnmapBufferMemory(m_upload_buffer);
			Vulkan::FreeBuffer(m_upload_buffer);
		}

		UploadBufferView& GetUploadView(const size_t a_upload_size)
		{
			(void)a_upload_size; //not used yet.
			OSAcquireSRWLockWrite(&m_lock);
			UploadBufferView& view = *m_free_views.Pop();
			//TODO, handle nullptr, maybe just wait or do the reset here?
			OSReleaseSRWLockWrite(&m_lock);
			return view;
		}

		void IncrementNextFenceValue()
		{
			//yes
			//maybe a lock is faster as it can be uncontested. Which may often be the case.
			BBInterlockedIncrement64(reinterpret_cast<volatile long long*>(&m_next_fence_value));
		}

		void GetFence(RFence& a_fence, uint64_t& a_next_fence_value)
		{
			a_fence = m_fence;
			a_next_fence_value = m_next_fence_value;
		}

		//return a upload view and set the fence value to the next fence value.
		void ReturnUploadViews(const BB::Slice<UploadBufferView> a_views, RFence& a_out_fence, uint64_t& a_out_next_fence_value)
		{
			OSAcquireSRWLockWrite(&m_in_flight_lock);
			for (size_t i = 0; i < a_views.size(); i++)
			{
				a_views[i].fence_value = m_next_fence_value;
				m_in_flight_views.Push(&m_views[a_views[i].pool_index]);
			}
			a_out_fence = m_fence;
			a_out_next_fence_value = m_next_fence_value;
			OSReleaseSRWLockWrite(&m_in_flight_lock);
		}

		void CheckIfInFlightDone()
		{
			LinkedList<UploadBufferView> local_view_free{};

			//lock as a write can be attempetd in m_in_flight_pools.
			OSAcquireSRWLockWrite(&m_in_flight_lock);
			m_last_completed_fence_value = Vulkan::GetCurrentFenceValue(m_fence);

			//Thank you Descent Raytracer teammates for the great code that I can steal
			for (UploadBufferView** in_flight_views = &m_in_flight_views.head; *in_flight_views;)
			{
				UploadBufferView* view = *in_flight_views;

				if (view->fence_value <= m_last_completed_fence_value)
				{
					//Get next in-flight commandlist
					*in_flight_views = view->next;
					local_view_free.Push(view);
				}
				else
				{
					in_flight_views = &view->next;
				}
			}

			if (local_view_free.HasEntry())
				m_free_views.MergeList(local_view_free);

			OSReleaseSRWLockWrite(&m_in_flight_lock);
		}

	private:
		RBuffer m_upload_buffer;			  //8
		void* m_upload_mem_start;			  //16

		UploadBufferView* m_views;			  //24
		LinkedList<UploadBufferView> m_free_views;		 //32
		LinkedList<UploadBufferView> m_in_flight_views;  //40
		BBRWLock m_in_flight_lock;		      //48
		BBRWLock m_lock;					  //56

		//this fence should be send to all execute commandlists when they include a upload buffer from here.
		RFence m_fence;						  //64
		volatile uint64_t m_next_fence_value; //72
		uint64_t m_last_completed_fence_value;//80

		const uint32_t m_upload_view_count;	  //84
	};
}

RCommandList CommandPool::StartCommandList(const char* a_name)
{
	BB_ASSERT(m_recording == false, "already recording a commandlist from this commandpool!");
	BB_ASSERT(m_list_current_free < m_list_count, "command pool out of lists!");
	RCommandList list{ m_lists[m_list_current_free++] };
	Vulkan::StartCommandList(list, a_name);
	m_recording = true;
	return list;
}

void CommandPool::EndCommandList(RCommandList a_list)
{
	BB_ASSERT(m_recording == true, "trying to end a commandlist while the pool is not recording any list");
	BB_ASSERT(a_list == m_lists[m_list_current_free - 1], "commandlist that was submitted is not from this pool or was already closed!");
	Vulkan::EndCommandList(a_list);
	m_recording = false;
}
void CommandPool::ResetPool()
{
	BB_ASSERT(m_recording == false, "trying to reset a pool while still recording");
	Vulkan::ResetCommandPool(m_api_cmd_pool);
	m_list_current_free = 0;
}

//THREAD SAFE: TRUE
class BB::RenderQueue
{
public:

	RenderQueue(Allocator a_system_allocator, const QUEUE_TYPE a_queue_type, const char* a_name, const uint32_t a_command_pool_count, const uint32_t a_command_lists_per_pool)
		:	m_pool_count(a_command_pool_count)
	{
		m_queue_type = a_queue_type;
		m_queue = Vulkan::GetQueue(a_queue_type, a_name);
		m_fence.fence = Vulkan::CreateFence(0, "make_it_queue_name_sam!!!");
		m_fence.last_complete_value = 0;
		m_fence.next_fence_value = 1;

		m_pools = BBnewArr(a_system_allocator, a_command_pool_count, CommandPool);
		for (uint32_t i = 0; i < a_command_pool_count; i++)
		{
			m_pools[i].pool_index = i;
			m_pools[i].m_recording = false;
			m_pools[i].m_fence_value = 0;
			m_pools[i].m_list_count = a_command_lists_per_pool;
			m_pools[i].m_list_current_free = 0;
			m_pools[i].m_lists = BBnewArr(a_system_allocator, m_pools[i].m_list_count, RCommandList);
			Vulkan::CreateCommandPool(a_queue_type, a_command_lists_per_pool, m_pools[i].m_api_cmd_pool, m_pools[i].m_lists);
		}

		for (uint32_t i = 0; i < a_command_pool_count - 1; i++)
		{
			m_pools[i].next = &m_pools[i + 1];
		}

		m_pools[a_command_pool_count - 1].next = nullptr;
		m_free_pools = &m_pools[0];
		m_lock = OSCreateRWLock();
		m_in_flight_lock = OSCreateRWLock();
	}
	~RenderQueue()
	{
		WaitIdle();
		Vulkan::FreeFence(m_fence.fence);
		for (uint32_t i = 0; i < m_pool_count; i++)
		{
			Vulkan::FreeCommandPool(m_pools[i].m_api_cmd_pool);
		}
	}

	CommandPool& GetCommandPool(const char* a_pool_name = "")
	{
		(void)a_pool_name; //not used yet.
		OSAcquireSRWLockWrite(&m_lock);
		CommandPool& pool = *m_free_pools.Pop();
		//TODO, handle nullptr, maybe just wait or do the reset here?
		OSReleaseSRWLockWrite(&m_lock);
		return pool;
	}

	void ReturnPool(CommandPool& a_pool)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		a_pool.m_fence_value = m_fence.next_fence_value;
		m_in_flight_pools.Push(&m_pools[a_pool.pool_index]);
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ReturnPools(const Slice<CommandPool> a_pools)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		for (size_t i = 0; i < a_pools.size(); i++)
		{
			a_pools[i].m_fence_value = m_fence.next_fence_value;
			m_in_flight_pools.Push(&m_pools[a_pools[i].pool_index]);
		}

		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ExecuteCommands(RCommandList* a_lists, const uint32_t a_list_count, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = a_list_count;
		execute_info.signal_fences = a_signal_fences;
		execute_info.signal_values = a_signal_values;
		execute_info.signal_count = a_signal_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		Vulkan::ExecuteCommandLists(m_queue, &execute_info, 1);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
	}

	void ExecutePresentCommands(const RCommandList a_list, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count, const uint32_t a_backbuffer_index)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");
		
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = &a_list;
		execute_info.list_count = 1;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		Vulkan::ExecutePresentCommandList(m_queue, execute_info, a_backbuffer_index);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
	}

	//void ExecutePresentCommands(CommandList* a_CommandLists, const uint32_t a_CommandListCount, const RenderFence* a_WaitFences, const PIPELINE_STAGE* a_WaitStages, const uint32_t a_FenceCount);
	void WaitFenceValue(const uint64_t a_fence_value)
	{
		LinkedList<CommandPool> local_list_free;

		Vulkan::WaitFence(m_fence.fence, a_fence_value);

		//lock as a write can be attempetd in m_in_flight_pools.
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		//Thank you Descent Raytracer teammates great code that I can steal
		for (CommandPool** in_flight_command_polls = &m_in_flight_pools.head; *in_flight_command_polls;)
		{
			CommandPool* command_pool = *in_flight_command_polls;

			if (command_pool->m_fence_value <= a_fence_value)
			{
				command_pool->ResetPool();

				//Get next in-flight commandlist
				*in_flight_command_polls = command_pool->next;
				local_list_free.Push(command_pool);
			}
			else
			{
				in_flight_command_polls = &command_pool->next;
			}
		}

		if (local_list_free.HasEntry())
			m_free_pools.MergeList(local_list_free);

		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void WaitIdle()
	{
		WaitFenceValue(m_fence.next_fence_value - 1);
	}

	RenderFence GetFence() const { return m_fence; }
	uint64_t GetNextFenceValue() const { return m_fence.next_fence_value; }
	uint64_t GetLastCompletedValue() const { return m_fence.last_complete_value; }

private:
	QUEUE_TYPE m_queue_type; //4
	BBRWLock m_lock; //12
	const uint32_t m_pool_count; //16
	CommandPool* m_pools; //24
	LinkedList<CommandPool> m_free_pools; //32 
	LinkedList<CommandPool> m_in_flight_pools; //40
	BBRWLock m_in_flight_lock; //48

	RQueue m_queue;//56 
	RenderFence m_fence; //80
};

struct Mesh
{
	BufferView vertex_buffer;
	BufferView index_buffer;
};

struct ShaderEffect
{
	const char* name;				//8
	ShaderObject shader_object;		//16
	RPipelineLayout pipeline_layout;//24
	SHADER_STAGE shader_stage;		//28
	SHADER_STAGE_FLAGS shader_stages_next; //32
};

struct Material
{
	struct Shader
	{
		RPipelineLayout pipeline_layout;
		
		ShaderObject shader_objects[UNIQUE_SHADER_STAGE_COUNT];
		SHADER_STAGE shader_stages[UNIQUE_SHADER_STAGE_COUNT];
		uint32_t shader_effect_count;
	} shader;


	RTexture base_color;
	RTexture normal_texture;
};

struct MeshDrawCall
{
	MeshHandle mesh;
	MaterialHandle material;
	uint32_t index_start;
	uint32_t index_count;
};

struct DrawList
{
	MeshDrawCall* mesh_draw_call;
	ShaderTransform* transform;
};

constexpr uint32_t UPLOAD_BUFFER_POOL_SIZE = mbSize * 8;
constexpr uint32_t UPLOAD_BUFFER_POOL_COUNT = 8;

struct RenderInterface_inst
{
	RenderInterface_inst(Allocator a_system_allocator)
		: graphics_queue(a_system_allocator, QUEUE_TYPE::GRAPHICS, "graphics queue", 8, 8),
		  upload_buffers(a_system_allocator, UPLOAD_BUFFER_POOL_SIZE, UPLOAD_BUFFER_POOL_COUNT)
	{}

	WindowHandle swapchain_window;
	uint32_t swapchain_width;
	uint32_t swapchain_height;
