#include "Renderer.hpp"
#include "VulkanRenderer.hpp"

#include "Storage/Slotmap.h"
#include "Storage/Queue.hpp"
#include "Program.h"

#include "ShaderCompiler.h"

#include "Math.inl"

#include "imgui.h"
#include "implot.h"

#include "BBThreadScheduler.hpp"

#include "GPUBuffers.hpp"

using namespace BB;

constexpr float3 SKYBOX_VERTICES[] = {
	{-1.0f,-1.0f,-1.0f},  // -X side
	{-1.0f,-1.0f, 1.0f},
	{-1.0f, 1.0f, 1.0f},
	{-1.0f, 1.0f, 1.0f},
	{-1.0f, 1.0f,-1.0f},
	{-1.0f,-1.0f,-1.0f},

	{-1.0f,-1.0f,-1.0f},  // -Z side
	{ 1.0f, 1.0f,-1.0f},
	{ 1.0f,-1.0f,-1.0f},
	{-1.0f,-1.0f,-1.0f},
	{-1.0f, 1.0f,-1.0f},
	{ 1.0f, 1.0f,-1.0f},

	{-1.0f,-1.0f,-1.0f},  // -Y side
	{ 1.0f,-1.0f,-1.0f},
	{ 1.0f,-1.0f, 1.0f},
	{-1.0f,-1.0f,-1.0f},
	{ 1.0f,-1.0f, 1.0f},
	{-1.0f,-1.0f, 1.0f},

	{-1.0f, 1.0f,-1.0f},  // +Y side
	{-1.0f, 1.0f, 1.0f},
	{ 1.0f, 1.0f, 1.0f},
	{-1.0f, 1.0f,-1.0f},
	{ 1.0f, 1.0f, 1.0f},
	{ 1.0f, 1.0f,-1.0f},

	{ 1.0f, 1.0f,-1.0f},  // +X side
	{ 1.0f, 1.0f, 1.0f},
	{ 1.0f,-1.0f, 1.0f},
	{ 1.0f,-1.0f, 1.0f},
	{ 1.0f,-1.0f,-1.0f},
	{ 1.0f, 1.0f,-1.0f},

	{-1.0f, 1.0f, 1.0f},  // +Z side
	{-1.0f,-1.0f, 1.0f},
	{ 1.0f, 1.0f, 1.0f},
	{-1.0f,-1.0f, 1.0f},
	{ 1.0f,-1.0f, 1.0f},
	{ 1.0f, 1.0f, 1.0f},
};

struct RenderFence
{
	uint64_t next_fence_value;
	uint64_t last_complete_value;
	RFence fence;
};

struct TextureInfo
{
	RImage image;				// 8
	Slice<RImageView> views;	// 24
	uint32_t descriptor_index;	// 28

	uint32_t width;				// 32
	uint32_t height;			// 36
	uint32_t array_layers;		// 40
	uint32_t mip_levels;		// 44
	IMAGE_FORMAT format;		// 48
	IMAGE_LAYOUT current_layout;// 52

	// debug extra, not required for anything
	IMAGE_USAGE usage;			// 56
};

constexpr uint32_t MAX_TEXTURES = 1024;

class GPUTextureManager
{
public:
	void Init(MemoryArena& a_arena, const RDescriptorLayout a_global_layout, const DescriptorAllocation& a_allocation)
	{
		m_graphics_texture_transitions.Init(a_arena, MAX_TEXTURES / 4);
		m_graphics_texture_transitions.resize(m_graphics_texture_transitions.capacity());

		m_views = ArenaAllocArr(a_arena, RImageView, MAX_TEXTURES);
		m_next_free = 0;
		m_lock = OSCreateRWLock();

		// setup the freelist before making the debug texture
		for (uint32_t i = m_next_free; i < MAX_TEXTURES - 1; i++)
		{
			m_views[i].index = i + 1;
		}
		m_views[MAX_TEXTURES - 1].index = UINT32_MAX;

		{	// create debug texture
			const uint32_t debug_purple = (209u << 0u) | (106u << 8u) | (255u << 16u) | (255u << 24u);
			CreateBasicColorImage(m_debug_image, m_debug_descriptor_index, "debug purple", debug_purple);
		}

		DescriptorWriteImageInfo image_write;
		image_write.descriptor_layout = a_global_layout;
		image_write.allocation = a_allocation;
		image_write.view = GetImageView(m_debug_descriptor_index);
		image_write.layout = IMAGE_LAYOUT::SHADER_READ_ONLY;
		image_write.binding = GLOBAL_BINDLESS_TEXTURES_BINDING;
		for (uint32_t i = 0; i < MAX_TEXTURES; i++)
		{
			image_write.descriptor_index = i;
			DescriptorWriteImage(image_write);
		}
	}

	const RDescriptorIndex AllocAndWriteImageView(const ImageViewCreateInfo& a_info, const RDescriptorLayout a_global_layout, const DescriptorAllocation& a_allocation)
	{
		OSAcquireSRWLockWrite(&m_lock);
		const uint32_t descriptor_index = m_next_free;
		m_next_free = m_views[descriptor_index].index;
		OSReleaseSRWLockWrite(&m_lock);

		m_views[descriptor_index] =  Vulkan::CreateImageView(a_info);

		DescriptorWriteImageInfo write_info;
		write_info.binding = GLOBAL_BINDLESS_TEXTURES_BINDING;
		write_info.descriptor_index = descriptor_index;
		write_info.view = m_views[descriptor_index];
		write_info.layout = IMAGE_LAYOUT::SHADER_READ_ONLY;
		write_info.allocation = a_allocation;
		write_info.descriptor_layout = a_global_layout;

		DescriptorWriteImage(write_info);

		return RDescriptorIndex(descriptor_index);
	}

	void FreeImageView(const RDescriptorIndex a_descriptor_index, const RDescriptorLayout a_global_layout, const DescriptorAllocation& a_allocation)
	{
		OSAcquireSRWLockWrite(&m_lock);
		Vulkan::FreeViewImage(m_views[a_descriptor_index.handle]);
		m_views[a_descriptor_index.handle].index = m_next_free;
		m_next_free = m_views[a_descriptor_index.handle].index;
		OSReleaseSRWLockWrite(&m_lock);

		DescriptorWriteImageInfo write_info;
		write_info.binding = GLOBAL_BINDLESS_TEXTURES_BINDING;
		write_info.descriptor_index = a_descriptor_index.handle;
		write_info.view = GetImageView(m_debug_descriptor_index);
		write_info.layout = IMAGE_LAYOUT::SHADER_READ_ONLY;
		write_info.allocation = a_allocation;
		write_info.descriptor_layout = a_global_layout;

		DescriptorWriteImage(write_info);
	}

	const RImageView GetImageView(const RDescriptorIndex a_index) const
	{
		return m_views[a_index.handle];
	}

	void TransitionTextures(const RCommandList a_list);

	void AddGraphicsTransition(const PipelineBarrierImageInfo& a_transition_info)
	{
		const uint32_t index = m_transition_size.fetch_add(1);
		m_graphics_texture_transitions[index] = a_transition_info;
	}

	void DisplayTextureListImgui()
	{
		if (ImGui::CollapsingHeader("Texture Manager"))
		{
			ImGui::Indent();
			if (ImGui::CollapsingHeader("next free image slot"))
			{
				ImGui::Indent();
				ImGui::Text("RImageView index: %u", m_next_free);
				const ImVec2 image_size = { 160, 160 };

				ImGui::Image(m_next_free, image_size);
				ImGui::Unindent();
			}

			for (uint32_t i = 0; i < MAX_TEXTURES; i++)
			{
				const size_t id = i;
				if (ImGui::TreeNodeEx(reinterpret_cast<void*>(id), 0, "Texture Slot: %u", i))
				{
					ImGui::Indent();

					const ImVec2 image_size = { 160, 160 };
					ImGui::Image(i, image_size);

					ImGui::Unindent();
					ImGui::TreePop();
				}
			}
			ImGui::Unindent();
		}
	}

	RDescriptorIndex GetDebugImageViewDescriptorIndex() const { return m_debug_descriptor_index; }
	RImageView GetDebugImageView() const { return GetImageView(m_debug_descriptor_index); }

private:
	uint32_t m_next_free;
	RImageView* m_views;
	BBRWLock m_lock;

	std::atomic<uint32_t> m_transition_size;
	StaticArray<PipelineBarrierImageInfo> m_graphics_texture_transitions;
	
	// purple color
	RImage m_debug_image;
	RDescriptorIndex m_debug_descriptor_index;
};

RCommandList CommandPool::StartCommandList(const char* a_name)
{
	BB_ASSERT(m_recording == false, "already recording a commandlist from this commandpool");
	BB_ASSERT(m_list_current_free < m_list_count, "command pool out of lists");
	RCommandList list{ m_lists[m_list_current_free++] };
	Vulkan::StartCommandList(list, a_name);
	m_recording = true;
	return list;
}

void CommandPool::EndCommandList(RCommandList a_list)
{
	BB_ASSERT(m_recording == true, "trying to end a commandlist while the pool is not recording any list");
	BB_ASSERT(a_list == m_lists[m_list_current_free - 1], "commandlist that was submitted is not from this pool or was already closed!");
	Vulkan::EndCommandList(a_list);
	m_recording = false;
}
void CommandPool::ResetPool()
{
	BB_ASSERT(m_recording == false, "trying to reset a pool while still recording");
	Vulkan::ResetCommandPool(m_api_cmd_pool);
	m_list_current_free = 0;
}

//THREAD SAFE: TRUE
class RenderQueue
{
private:
	BBRWLock m_lock; //8
	QUEUE_TYPE m_queue_type; //12
	const uint32_t m_pool_count; //16
	CommandPool* m_pools; //24
	LinkedList<CommandPool> m_free_pools; //32 
	LinkedList<CommandPool> m_in_flight_pools; //40
	BBRWLock m_in_flight_lock; //48

	RQueue m_queue;//56 
	RenderFence m_fence; //80

public:
	RenderQueue(MemoryArena& a_arena, const QUEUE_TYPE a_queue_type, const char* a_name, const uint32_t a_command_pool_count, const uint32_t a_command_lists_per_pool)
		:	m_pool_count(a_command_pool_count)
	{
		m_queue_type = a_queue_type;
		m_queue = Vulkan::GetQueue(a_queue_type, a_name);
		m_fence.fence = Vulkan::CreateFence(0, "make_it_queue_name_sam!!!");
		m_fence.last_complete_value = 0;
		m_fence.next_fence_value = 1;

		m_pools = ArenaAllocArr(a_arena, CommandPool, a_command_pool_count);
		for (uint32_t i = 0; i < a_command_pool_count; i++)
		{
			m_pools[i].pool_index = i;
			m_pools[i].m_recording = false;
			m_pools[i].m_fence_value = 0;
			m_pools[i].m_list_count = a_command_lists_per_pool;
			m_pools[i].m_list_current_free = 0;
			m_pools[i].m_lists = ArenaAllocArr(a_arena, RCommandList, m_pools[i].m_list_count);
			Vulkan::CreateCommandPool(a_queue_type, a_command_lists_per_pool, m_pools[i].m_api_cmd_pool, m_pools[i].m_lists);
		}

		for (uint32_t i = 0; i < a_command_pool_count - 1; i++)
		{
			m_pools[i].next = &m_pools[i + 1];
		}

		m_pools[a_command_pool_count - 1].next = nullptr;
		m_free_pools = &m_pools[0];
		m_lock = OSCreateRWLock();
		m_in_flight_lock = OSCreateRWLock();
	}
	~RenderQueue()
	{
		WaitIdle();
		Vulkan::FreeFence(m_fence.fence);
		for (uint32_t i = 0; i < m_pool_count; i++)
		{
			Vulkan::FreeCommandPool(m_pools[i].m_api_cmd_pool);
		}
	}

	CommandPool& GetCommandPool(const char* a_pool_name = "")
	{
		(void)a_pool_name; //not used yet.
		OSAcquireSRWLockWrite(&m_lock);

		if (m_free_pools.head == nullptr)
		{
			OSReleaseSRWLockWrite(&m_lock);
			WaitIdle();	// TODO: wait idle optimal? No
			OSAcquireSRWLockWrite(&m_lock);
		}
		CommandPool& pool = *m_free_pools.Pop();
		OSReleaseSRWLockWrite(&m_lock);
		return pool;
	}

	void ReturnPool(CommandPool& a_pool)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		a_pool.m_fence_value = m_fence.next_fence_value;
		m_in_flight_pools.Push(&m_pools[a_pool.pool_index]);
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ReturnPools(const Slice<CommandPool> a_pools)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		for (size_t i = 0; i < a_pools.size(); i++)
		{
			m_pools[a_pools[i].pool_index].m_fence_value = m_fence.next_fence_value;
			m_in_flight_pools.Push(&m_pools[a_pools[i].pool_index]);
		}

		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	bool ExecuteCommands(const RCommandList* const a_lists, const uint32_t a_list_count, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count, uint64_t& a_out_fence_value)
	{
		OSAcquireSRWLockWrite(&m_lock);
		//better way to do this?
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = a_list_count;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;


		Vulkan::ExecuteCommandLists(m_queue, &execute_info, 1);
		a_out_fence_value = m_fence.next_fence_value++;
		OSReleaseSRWLockWrite(&m_lock);
		return true;
	}

	PRESENT_IMAGE_RESULT ExecutePresentCommands(RCommandList* const a_lists, const uint32_t a_list_count, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count, const uint32_t a_backbuffer_index, uint64_t& a_out_fence_value)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");
		
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = a_list_count;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		const PRESENT_IMAGE_RESULT result = Vulkan::ExecutePresentCommandList(m_queue, execute_info, a_backbuffer_index);
		a_out_fence_value = m_fence.next_fence_value++;
		OSReleaseSRWLockWrite(&m_lock);
		return result;
	}

	//void ExecutePresentCommands(CommandList* a_CommandLists, const uint32_t a_CommandListCount, const RenderFence* a_WaitFences, const PIPELINE_STAGE* a_WaitStages, const uint32_t a_FenceCount);
	void WaitFenceValue(const uint64_t a_fence_value)
	{
		LinkedList<CommandPool> local_list_free;

		Vulkan::WaitFence(m_fence.fence, a_fence_value);

		//lock as a write can be attempetd in m_in_flight_pools.
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		//Thank you Descent Raytracer teammates great code that I can steal
		for (CommandPool** in_flight_command_polls = &m_in_flight_pools.head; *in_flight_command_polls;)
		{
			CommandPool* command_pool = *in_flight_command_polls;

			if (command_pool->m_fence_value <= a_fence_value)
			{
				command_pool->ResetPool();

				//Get next in-flight commandlist
				*in_flight_command_polls = command_pool->next;
				local_list_free.Push(command_pool);
			}
			else
			{
				in_flight_command_polls = &command_pool->next;
			}
		}

		if (local_list_free.HasEntry())
			m_free_pools.MergeList(local_list_free);


		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void WaitIdle()
	{
		WaitFenceValue(m_fence.next_fence_value - 1);
	}

	RenderFence GetFence() const { return m_fence; }
	uint64_t GetNextFenceValue() const { return m_fence.next_fence_value; }
	uint64_t GetLastCompletedValue() const { return m_fence.last_complete_value; }
};

struct ShaderEffect
{
	const char* name;				//8
	ShaderObject shader_object;		//16
	RPipelineLayout pipeline_layout;//24
	SHADER_STAGE shader_stage;		//28
	SHADER_STAGE_FLAGS shader_stages_next; //32

#ifdef _ENABLE_REBUILD_SHADERS
	const char* shader_entry;
	ShaderObjectCreateInfo create_info;
#endif // _ENABLE_REBUILD_SHADERS
};

constexpr uint32_t BACK_BUFFER_MAX = 3;

struct RenderInterface_inst
{
	RenderInterface_inst(MemoryArena& a_arena)
		: graphics_queue(a_arena, QUEUE_TYPE::GRAPHICS, "graphics queue", 32, 32),
		  transfer_queue(a_arena, QUEUE_TYPE::TRANSFER, "transfer queue", 8, 8)
	{}

	RenderIO render_io;

	RImage render_target_image;
	struct Frame
	{
		RImageView render_target_view;
		RDescriptorIndex render_target_descriptor;
		uint64_t graphics_queue_fence_value;
	};
	Frame* frames;
	bool debug;

	ShaderCompiler shader_compiler;

	RenderQueue graphics_queue;
	RenderQueue transfer_queue;

	GPUTextureManager texture_manager;
	struct BasicColorImage
	{
		RImage image;
		RDescriptorIndex index;
	};
	BasicColorImage white;
	BasicColorImage black;

	GPUBufferView cubemap_position;

	RDescriptorLayout static_sampler_descriptor_set;
	RDescriptorLayout global_descriptor_set;
	DescriptorAllocation global_descriptor_allocation;

	struct GlobalBuffer
	{
		GlobalRenderData data;
		GPUBuffer buffer;
		void* mapped;
	} global_buffer;

	struct VertexBuffer
	{
		GPUBuffer buffer;
		uint64_t size;
		std::atomic<uint64_t> used;
	} vertex_buffer;
	struct CPUVertexBuffer
	{
		GPUBuffer buffer;
		uint64_t size;
		std::atomic<uint64_t> used;
		void* start_mapped;
	} cpu_vertex_buffer;

	struct IndexBuffer
	{
		GPUBuffer buffer;
		uint64_t size;
		std::atomic<uint64_t> used;
	} index_buffer;
	struct CPUIndexBuffer
	{
		GPUBuffer buffer;
		uint64_t size;
		std::atomic<uint64_t> used;
		void* start_mapped;
	} cpu_index_buffer;

	StaticSlotmap<ShaderEffect, ShaderEffectHandle> shader_effects{};
};

static RenderInterface_inst* s_render_inst;



namespace IMGUI_IMPL
{
	constexpr size_t INITIAL_VERTEX_SIZE = sizeof(Vertex2D) * 128;
	constexpr size_t INITIAL_INDEX_SIZE = sizeof(uint32_t) * 256;

	struct ImRenderBuffer
	{
		WriteableGPUBufferView vertex_buffer;
		WriteableGPUBufferView index_buffer;
	};

	struct ImRenderData
	{
		RImage font_image;				 // 8
		RDescriptorIndex font_descriptor;// 12

		// Render buffers for main window
		uint32_t frame_index;            // 16
		ImRenderBuffer* frame_buffers;	 // 24
	};

	inline static ImRenderData* ImGetRenderData()
	{
		return ImGui::GetCurrentContext() ? reinterpret_cast<ImRenderData*>(ImGui::GetIO().BackendRendererUserData) : nullptr;
	}

	inline static void ImSetRenderState(const ImDrawData& a_draw_data, const RCommandList a_cmd_list, const uint32_t a_vert_pos, const ShaderObject* a_vertex_and_fragment, const RPipelineLayout a_pipeline_layout)
	{
		ImRenderData* bd = ImGetRenderData();

		{
			constexpr SHADER_STAGE IMGUI_SHADER_STAGES[2]{ SHADER_STAGE::VERTEX, SHADER_STAGE::FRAGMENT_PIXEL };
			Vulkan::BindShaders(a_cmd_list, _countof(IMGUI_SHADER_STAGES), IMGUI_SHADER_STAGES, a_vertex_and_fragment);
			Vulkan::SetFrontFace(a_cmd_list, true);
			Vulkan::SetCullMode(a_cmd_list, CULL_MODE::NONE);
		}

		// Setup scale and translation:
