#include "Renderer.hpp"
#include "VulkanRenderer.hpp"

#include "Storage/Slotmap.h"
#include "Storage/Queue.hpp"
#include "Program.h"

#include "ShaderCompiler.h"

#include "Math.inl"

#include "imgui.h"

using namespace BB;

struct RenderFence
{
	uint64_t next_fence_value;
	uint64_t last_complete_value;
	RFence fence;
};

constexpr uint32_t MAX_TEXTURES = 1024;
constexpr const char* DEBUG_TEXTURE_NAME = "debug texture";

static IMAGE_FORMAT DEPTH_IMAGE_FORMAT;
constexpr IMAGE_FORMAT RENDER_TARGET_IMAGE_FORMAT = IMAGE_FORMAT::RGBA8_SRGB;

class GPUTextureManager
{
public:
	struct TextureInfo
	{
		RImage image;				// 8
		RImageView view;			// 16

		uint32_t width;				// 20
		uint32_t height;			// 24
		IMAGE_FORMAT format;		// 28
		IMAGE_LAYOUT current_layout;// 32
	};

	struct TextureSlot
	{
		TextureInfo texture_info;	// 28
		const char* name;			// 36
		uint32_t next_free;			// 40
	};

	void Init(MemoryArena& a_arena, const RCommandList a_list, const uint64_t a_upload_fence_value);

	const RTexture UploadTexture(const RCommandList a_list, const UploadTextureInfo& a_upload_info, const uint64_t a_upload_fence_value);
	const RTexture CreateRenderTarget(const uint2 a_render_target_extent, const char* a_name);
	const RTexture CreateUploadTarget(const uint2 a_extent, const char* a_name);
	const RTexture CreateDepthImage(const uint2 a_depth_image_extent, const char* a_name);
	void FreeTexture(const RTexture a_texture);

	TextureSlot& GetTextureSlot(const RTexture a_texture)
	{
		return m_textures[a_texture.handle];
	}

	void TransitionGraphicsQueueTexture(const RCommandList a_list)
	{
		if (m_graphics_texture_transitions.size() == 0)
			return;
		OSAcquireSRWLockWrite(&m_lock);
		PipelineBarrierInfo barrier_info{};
		barrier_info.image_infos = m_graphics_texture_transitions.data();
		barrier_info.image_info_count = m_graphics_texture_transitions.size();
		Vulkan::PipelineBarriers(a_list, barrier_info);
		m_graphics_texture_transitions.clear();
		OSReleaseSRWLockWrite(&m_lock);
	}

	void DisplayTextureListImgui()
	{
		if (ImGui::CollapsingHeader("Texture Manager"))
		{
			ImGui::Indent();
			if (ImGui::CollapsingHeader("next free image slot"))
			{
				ImGui::Indent();
				ImGui::Text("Texture slot index: %u", m_next_free);
				const ImVec2 image_size = { 160, 160 };
				ImGui::Image(m_next_free, image_size);
				ImGui::Unindent();
			}

			for (uint32_t i = 0; i < MAX_TEXTURES; i++)
			{
				const TextureSlot& slot = m_textures[i];
				const size_t id = i;
				if (ImGui::TreeNodeEx(reinterpret_cast<void*>(id), 0, "Texture Slot: %u", i))
				{
					ImGui::Indent();
					if (slot.name != nullptr)
						ImGui::TextUnformatted(slot.name);
					else
						ImGui::Text("UNNAMED! This might be an error");
					const ImVec2 image_size = { 160, 160 };
					ImGui::Image(i, image_size);
					ImGui::Unindent();
					ImGui::TreePop();
				}
			}
			ImGui::Unindent();
		}
	}

	RTexture GetDebugTexture() const { return RTexture(0); }

private:
	uint32_t m_next_free;
	TextureSlot m_textures[MAX_TEXTURES];
	BBRWLock m_lock;

	StaticArray<PipelineBarrierImageInfo> m_graphics_texture_transitions;

	//purple color
	TextureInfo m_debug_texture;
};

RCommandList CommandPool::StartCommandList(const char* a_name)
{
	BB_ASSERT(m_recording == false, "already recording a commandlist from this commandpool!");
	BB_ASSERT(m_list_current_free < m_list_count, "command pool out of lists!");
	RCommandList list{ m_lists[m_list_current_free++] };
	Vulkan::StartCommandList(list, a_name);
	m_recording = true;
	return list;
}

void CommandPool::EndCommandList(RCommandList a_list)
{
	BB_ASSERT(m_recording == true, "trying to end a commandlist while the pool is not recording any list");
	BB_ASSERT(a_list == m_lists[m_list_current_free - 1], "commandlist that was submitted is not from this pool or was already closed!");
	Vulkan::EndCommandList(a_list);
	m_recording = false;
}
void CommandPool::ResetPool()
{
	BB_ASSERT(m_recording == false, "trying to reset a pool while still recording");
	Vulkan::ResetCommandPool(m_api_cmd_pool);
	m_list_current_free = 0;
}

struct UploadBuffer
{
	void SafeMemcpy(const size_t a_dest_offset, const void* a_src, const size_t a_src_size) const
	{
		void* copy_pos = Pointer::Add(begin, a_dest_offset);
		BB_ASSERT(Pointer::Add(copy_pos, a_src_size) <= end, "gpu upload buffer writing out of bounds");

		memcpy(copy_pos, a_src, a_src_size);
	}

	GPUBuffer buffer;
	void* begin;
	void* end;
	size_t base_offset;
};

constexpr size_t RING_BUFFER_QUEUE_ELEMENT_COUNT = 1024;
class UploadRingAllocator
{
public:
	void Init(MemoryArena& a_arena, const size_t a_ring_buffer_size, const RFence a_fence, const char* a_name)
	{
		GPUBufferCreateInfo create_info;
		create_info.type = BUFFER_TYPE::UPLOAD;
		create_info.size = a_ring_buffer_size;
		create_info.name = a_name;
		create_info.host_writable = true;

		m_lock = OSCreateRWLock();
		m_fence = a_fence;
		m_buffer = Vulkan::CreateBuffer(create_info);
		m_begin = Vulkan::MapBufferMemory(m_buffer);
		m_write_at = m_begin;
		m_end = Pointer::Add(m_begin, a_ring_buffer_size);
		m_free_until = m_end;
		m_locked_queue.Init(a_arena, RING_BUFFER_QUEUE_ELEMENT_COUNT);
	}

	UploadBuffer AllocateUploadMemory(const size_t a_byte_amount, const uint64_t a_fence_value)
	{
		BB_ASSERT(a_byte_amount < GetUploadAllocatorCapacity(), "trying to upload more memory then the ringbuffer size");
		OSAcquireSRWLockWrite(&m_lock);

		void* begin = m_write_at;
		void* end = Pointer::Add(m_write_at, a_byte_amount);

		bool must_free_memory = end > m_free_until ? true : false;

		// if we go over the end, but not over the readpointer then recalculate
		if (end > m_end)
		{
			begin = m_begin;
			end = Pointer::Add(m_begin, a_byte_amount);
			// is free_until larger then end? if yes then we can allocate without waiting
			must_free_memory = end > m_free_until ? true : false;
		}

		if (m_locked_queue.IsFull())
			must_free_memory = true;

		if (must_free_memory)
		{
			const uint64_t fence_value = Vulkan::GetCurrentFenceValue(m_fence);

			while (const UploadRingAllocator::LockedRegions* locked_region = m_locked_queue.Peek())
			{
				if (locked_region->fence_value <= fence_value)
				{
					m_free_until = locked_region->memory_end;
					m_locked_queue.DeQueue();
				}
				else
					break;
			}
		}

		UploadRingAllocator::LockedRegions locked_region;
		locked_region.memory_end = end;
		locked_region.fence_value = a_fence_value;
		m_locked_queue.EnQueue(locked_region);
		m_write_at = end;

		OSReleaseSRWLockWrite(&m_lock);

		UploadBuffer upload_buffer;
		upload_buffer.buffer = m_buffer;
		upload_buffer.begin = begin;
		upload_buffer.end = end;
		upload_buffer.base_offset = reinterpret_cast<size_t>(Pointer::Subtract(begin, reinterpret_cast<size_t>(m_begin)));
		return upload_buffer;
	}

	size_t GetUploadAllocatorCapacity() const
	{
		return reinterpret_cast<size_t>(m_end) - reinterpret_cast<size_t>(m_begin);
	}

private:
	struct LockedRegions
	{
		void* memory_end;
		uint64_t fence_value;
	};

	BBRWLock m_lock;
	RFence m_fence;
	GPUBuffer m_buffer;
	
	void* m_begin;
	void* m_free_until;
	void* m_write_at;
	void* m_end;
	Queue<LockedRegions> m_locked_queue;
};

//THREAD SAFE: TRUE
class BB::RenderQueue
{
public:
	RenderQueue(MemoryArena& a_arena, const QUEUE_TYPE a_queue_type, const char* a_name, const uint32_t a_command_pool_count, const uint32_t a_command_lists_per_pool)
		:	m_pool_count(a_command_pool_count)
	{
		m_queue_type = a_queue_type;
		m_queue = Vulkan::GetQueue(a_queue_type, a_name);
		m_fence.fence = Vulkan::CreateFence(0, "make_it_queue_name_sam!!!");
		m_fence.last_complete_value = 0;
		m_fence.next_fence_value = 1;

		m_pools = ArenaAllocArr(a_arena, CommandPool, a_command_pool_count);
		for (uint32_t i = 0; i < a_command_pool_count; i++)
		{
			m_pools[i].pool_index = i;
			m_pools[i].m_recording = false;
			m_pools[i].m_fence_value = 0;
			m_pools[i].m_list_count = a_command_lists_per_pool;
			m_pools[i].m_list_current_free = 0;
			m_pools[i].m_lists = ArenaAllocArr(a_arena, RCommandList, m_pools[i].m_list_count);
			Vulkan::CreateCommandPool(a_queue_type, a_command_lists_per_pool, m_pools[i].m_api_cmd_pool, m_pools[i].m_lists);
		}

		for (uint32_t i = 0; i < a_command_pool_count - 1; i++)
		{
			m_pools[i].next = &m_pools[i + 1];
		}

		m_pools[a_command_pool_count - 1].next = nullptr;
		m_free_pools = &m_pools[0];
		m_lock = OSCreateRWLock();
		m_in_flight_lock = OSCreateRWLock();
	}
	~RenderQueue()
	{
		WaitIdle();
		Vulkan::FreeFence(m_fence.fence);
		for (uint32_t i = 0; i < m_pool_count; i++)
		{
			Vulkan::FreeCommandPool(m_pools[i].m_api_cmd_pool);
		}
	}

	CommandPool& GetCommandPool(const char* a_pool_name = "")
	{
		(void)a_pool_name; //not used yet.
		OSAcquireSRWLockWrite(&m_lock);

		if (m_free_pools.head == nullptr)
		{
			OSReleaseSRWLockWrite(&m_lock);
			WaitIdle();	// TODO: wait idle optimal? No
			OSAcquireSRWLockWrite(&m_lock);
		}
		CommandPool& pool = *m_free_pools.Pop();
		OSReleaseSRWLockWrite(&m_lock);
		return pool;
	}

	void ReturnPool(CommandPool& a_pool)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		a_pool.m_fence_value = m_fence.next_fence_value;
		m_in_flight_pools.Push(&m_pools[a_pool.pool_index]);
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ReturnPools(const Slice<CommandPool> a_pools)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		for (size_t i = 0; i < a_pools.size(); i++)
		{
			m_pools[a_pools[i].pool_index].m_fence_value = m_fence.next_fence_value;
			m_in_flight_pools.Push(&m_pools[a_pools[i].pool_index]);
		}

		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ExecuteCommands(const RCommandList* const a_lists, const uint32_t a_list_count, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count)
	{
		OSAcquireSRWLockWrite(&m_lock);
		//better way to do this?
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = a_list_count;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;


		Vulkan::ExecuteCommandLists(m_queue, &execute_info, 1);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
	}

	PRESENT_IMAGE_RESULT ExecutePresentCommands(RCommandList* const a_lists, const uint32_t a_list_count, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count, const uint32_t a_backbuffer_index)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");
		
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = a_list_count;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		const PRESENT_IMAGE_RESULT result = Vulkan::ExecutePresentCommandList(m_queue, execute_info, a_backbuffer_index);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
		return result;
	}

	//void ExecutePresentCommands(CommandList* a_CommandLists, const uint32_t a_CommandListCount, const RenderFence* a_WaitFences, const PIPELINE_STAGE* a_WaitStages, const uint32_t a_FenceCount);
	void WaitFenceValue(const uint64_t a_fence_value)
	{
		LinkedList<CommandPool> local_list_free;

		Vulkan::WaitFence(m_fence.fence, a_fence_value);

		//lock as a write can be attempetd in m_in_flight_pools.
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		//Thank you Descent Raytracer teammates great code that I can steal
		for (CommandPool** in_flight_command_polls = &m_in_flight_pools.head; *in_flight_command_polls;)
		{
			CommandPool* command_pool = *in_flight_command_polls;

			if (command_pool->m_fence_value <= a_fence_value)
			{
				command_pool->ResetPool();

				//Get next in-flight commandlist
				*in_flight_command_polls = command_pool->next;
				local_list_free.Push(command_pool);
			}
			else
			{
				in_flight_command_polls = &command_pool->next;
			}
		}

		if (local_list_free.HasEntry())
			m_free_pools.MergeList(local_list_free);


		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void WaitIdle()
	{
		WaitFenceValue(m_fence.next_fence_value - 1);
	}

	RenderFence GetFence() const { return m_fence; }
	uint64_t GetNextFenceValue() const { return m_fence.next_fence_value; }
	uint64_t GetLastCompletedValue() const { return m_fence.last_complete_value; }

private:
	QUEUE_TYPE m_queue_type; //4
	BBRWLock m_lock; //12
	const uint32_t m_pool_count; //16
	CommandPool* m_pools; //24
	LinkedList<CommandPool> m_free_pools; //32 
	LinkedList<CommandPool> m_in_flight_pools; //40
	BBRWLock m_in_flight_lock; //48

	RQueue m_queue;//56 
	RenderFence m_fence; //80
};

struct Mesh
{
	GPUBufferView vertex_buffer;
	GPUBufferView index_buffer;
};

struct ShaderEffect
{
	const char* name;				//8
	ShaderObject shader_object;		//16
	RPipelineLayout pipeline_layout;//24
	SHADER_STAGE shader_stage;		//28
	SHADER_STAGE_FLAGS shader_stages_next; //32

#ifdef _ENABLE_REBUILD_SHADERS
	const char* shader_entry;
	const char* shader_path;
	ShaderObjectCreateInfo create_info;
#endif // _ENABLE_REBUILD_SHADERS
};

struct Material
{
	struct Shader
	{
		RPipelineLayout pipeline_layout;
		
		ShaderObject shader_objects[UNIQUE_SHADER_STAGE_COUNT];
		SHADER_STAGE shader_stages[UNIQUE_SHADER_STAGE_COUNT];
		uint32_t shader_effect_count;
	} shader;


	RTexture base_color;
	RTexture normal_texture;
};

struct MeshDrawCall
{
	MeshHandle mesh;
	MaterialHandle material;
	uint32_t index_start;
	uint32_t index_count;
};

struct DrawList
{
	MeshDrawCall* mesh_draw_call;
	ShaderTransform* transform;
};

union Light
{
	PointLight point_light;
};

constexpr uint32_t BACK_BUFFER_MAX = 3;

struct Scene3D
{
	struct Frame
	{
		GPUBuffer per_frame_buffer;
		size_t per_frame_buffer_size;

		struct PerFrameBufferPart
		{
			uint32_t offset;
			uint32_t size;
		};
		PerFrameBufferPart scene_buffer;
		PerFrameBufferPart transform_buffer;
		PerFrameBufferPart light_buffer;
		DescriptorAllocation desc_alloc;
		uint64_t fence_value;
	};

	Frame* frames;
	Scene3DInfo scene_info;

	RImage depth_image;
	RImageView depth_image_view;
	uint2 previous_draw_area;

	uint32_t draw_list_count;
	uint32_t draw_list_max;
	DrawList draw_list_data;

	const char* scene_name;

	//we have different scenes but the light handles are the same. Meaning we can accidently mess this up. Maybe make this a freelist instead of a slotmap.
	StaticSlotmap<PointLight, LightHandle> light_container;
};

struct RenderInterface_inst
{
	RenderInterface_inst(MemoryArena& a_arena)
		: graphics_queue(a_arena, QUEUE_TYPE::GRAPHICS, "graphics queue", 32, 32),
		  transfer_queue(a_arena, QUEUE_TYPE::TRANSFER, "transfer queue", 8, 8)
	{}

	RenderIO render_io;

	struct Frame
	{
		RTexture render_target;
		uint64_t graphics_queue_fence_value;
	};
	Frame* frames;
	bool debug;

	ShaderCompiler shader_compiler;

	// transfer queue should always use this
	UploadRingAllocator asset_upload_allocator;
	RFence asset_upload_fence;
	volatile uint64_t asset_upload_next_fence_value;
	BBRWLock asset_upload_value_lock;		// yes, a lock for a single variable

	UploadRingAllocator frame_upload_allocator;
	RenderQueue graphics_queue;
	RenderQueue transfer_queue;

	GPUTextureManager texture_manager;

	RTexture white;
	RTexture black;

	RDescriptorLayout static_sampler_descriptor_set;
	RDescriptorLayout global_descriptor_set;
	DescriptorAllocation global_descriptor_allocation;

	RDescriptorLayout scene3d_descriptor_layout;

	struct VertexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
	} vertex_buffer;
	struct CPUVertexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
		void* start_mapped;
	} cpu_vertex_buffer;

	struct IndexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
	} index_buffer;
	struct CPUIndexBuffer
	{
		GPUBuffer buffer;
		uint32_t size;
		uint32_t used;
		void* start_mapped;
	} cpu_index_buffer;

	StaticSlotmap<Mesh, MeshHandle> mesh_map{};
	StaticSlotmap<ShaderEffect, ShaderEffectHandle> shader_effect_map{};
	StaticSlotmap<Material, MaterialHandle> material_map{};

	GPUDeviceInfo gpu_device;
};

static RenderInterface_inst* s_render_inst;

namespace IMGUI_IMPL
{
	constexpr size_t INITIAL_VERTEX_SIZE = sizeof(Vertex2D) * 128;
	constexpr size_t INITIAL_INDEX_SIZE = sizeof(uint32_t) * 256;

	struct ImRenderBuffer
	{
		WriteableGPUBufferView vertex_buffer;
		WriteableGPUBufferView index_buffer;
	};

	constexpr SHADER_STAGE IMGUI_SHADER_STAGES[2]{ SHADER_STAGE::VERTEX, SHADER_STAGE::FRAGMENT_PIXEL };

	struct ImRenderData
	{
		// 0 = VERTEX, 1 = FRAGMENT
		ShaderEffectHandle		shader_effects[2];	//16
		RTexture				font_image;         //20

		// Render buffers for main window
		uint32_t frame_index;                       //24
		ImRenderBuffer* frame_buffers;				//32

		//we just fetch em directly
		const ShaderEffect* vertex;
		const ShaderEffect* fragment;
	};

	inline static ImRenderData* ImGetRenderData()
	{
		return ImGui::GetCurrentContext() ? reinterpret_cast<ImRenderData*>(ImGui::GetIO().BackendRendererUserData) : nullptr;
	}

	inline static void ImSetRenderState(const ImDrawData& a_draw_data, const RCommandList a_cmd_list, const uint32_t a_vert_pos)
	{
		ImRenderData* bd = ImGetRenderData();

		{
			const ShaderObject shader_objects[2]{ bd->vertex->shader_object, bd->fragment->shader_object };
			Vulkan::BindShaders(a_cmd_list, _countof(IMGUI_SHADER_STAGES), IMGUI_SHADER_STAGES, shader_objects);
		}

		// Setup scale and translation:
		// Our visible imgui space lies from draw_data->DisplayPps (top left) to draw_data->DisplayPos+data_data->DisplaySize (bottom right). DisplayPos is (0,0) for single viewport apps.
		{
			ShaderIndices2D shader_indices;
