#include "Renderer.hpp"
#include "VulkanRenderer.hpp"

#include "Storage/Slotmap.h"
#include "Program.h"

#include "ShaderCompiler.h"

#include "BBIntrin.h"

using namespace BB;

struct RenderFence
{
	uint64_t next_fence_value;
	uint64_t last_complete_value;
	RFence fence;
};

struct UploadBufferView
{
	friend class UploadBufferPool;
	RBuffer upload_buffer_handle;	//8
	void* view_mem_start;			//16
	//I suppose we never make an upload buffer bigger then 2-4 gb? test for it on uploadbufferpool creation
	uint32_t offset;				//20
	uint32_t size;					//24
	uint64_t fence_value;			//32
	UploadBufferView* next;			//40

	void MemoryCopy(void* a_src, const uint32_t a_byte_offset, const uint32_t a_byte_size)
	{
		memcpy(Pointer::Add(view_mem_start, a_byte_offset), a_src, a_byte_size);
	}
};

/// <summary>
/// Handles one large upload buffer and handles it as if it's seperate buffers by handling chunks.
/// </summary>
class UploadBufferPool
{
public:
	UploadBufferPool(Allocator a_sys_allocator, const size_t a_size_per_pool, const uint32_t a_pool_count)
		:	m_upload_view_count(a_pool_count)
	{
		const size_t upload_buffer_size = a_size_per_pool * m_upload_view_count;
		BB_ASSERT(upload_buffer_size < UINT32_MAX, "we use uint32_t for offset and size but the uploadbuffer size is bigger then UINT32_MAX");

		BufferCreateInfo buffer_info;
		buffer_info.type = BUFFER_TYPE::UPLOAD;
		buffer_info.size = upload_buffer_size;
		buffer_info.host_writable = true;
		buffer_info.name = "upload_buffer_pool";
		m_upload_buffer = Vulkan::CreateBuffer(buffer_info);
		m_upload_mem_start = Vulkan::MapBufferMemory(m_upload_buffer);

		m_views = BBnewArr(a_sys_allocator, m_upload_view_count, UploadBufferView);
		for (size_t i = 0; i < m_upload_view_count; i++)
		{
			m_views[i].upload_buffer_handle = m_upload_buffer;
			m_views[i].size = static_cast<uint32_t>(a_size_per_pool);
			m_views[i].offset = static_cast<uint32_t>(i * a_size_per_pool);
			m_views[i].view_mem_start = Pointer::Add(m_upload_mem_start, m_views[i].offset);
			m_views[i].fence_value = 0;
		}

		for (uint32_t i = 0; i < m_upload_view_count - 1; i++)
		{
			m_views[i].next = &m_views[i + 1];
		}

		m_free_views = m_views;
		m_in_flight_views = nullptr;
		m_lock = OSCreateRWLock();
		m_in_flight_lock = OSCreateRWLock();

		m_fence = Vulkan::CreateFence(0, "upload buffer fence");
		m_last_completed_fence_value = 0;
		m_next_fence_value = 1;
	}
	~UploadBufferPool()
	{
		Vulkan::UnmapBufferMemory(m_upload_buffer);
		Vulkan::FreeBuffer(m_upload_buffer);
	}

	UploadBufferView* GetUploadView(const char* a_pool_name = "")
	{
		OSAcquireSRWLockWrite(&m_lock);
		UploadBufferView* view = BB_SLL_POP(m_free_views);
		//TODO, handle nullptr, maybe just wait or do the reset here?
		OSReleaseSRWLockWrite(&m_lock);
		return view;
	}

	void IncrementNextFenceValue()
	{
		//yes
		//maybe a lock is faster as it can be uncontested. Which may often be the case.
		BBInterlockedIncrement64(reinterpret_cast<volatile long long*>(&m_next_fence_value));
	}

	void GetFence(RFence* a_fence, uint64_t* a_next_fence_value)
	{
		*a_fence = m_fence;
		*a_next_fence_value = m_next_fence_value;
	}

	//return a upload view and give it a fence value that you get from UploadBufferPool::GetFence
	void ReturnUploadView(UploadBufferView* a_view, const uint64_t a_fence_value)
	{
		a_view->fence_value = a_fence_value;
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		BB_SLL_PUSH(m_in_flight_views, a_view);
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void CheckIfInFlightDone()
	{
		UploadBufferView* local_view_free = nullptr;

		//lock as a write can be attempetd in m_in_flight_pools.
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		m_last_completed_fence_value = Vulkan::GetCurrentFenceValue(m_fence);

		//Thank you Descent Raytracer teammates great code that I can steal
		for (UploadBufferView** in_flight_views = &m_in_flight_views; *in_flight_views;)
		{
			UploadBufferView* view = *in_flight_views;

			if (view->fence_value <= m_last_completed_fence_value)
			{
				//Get next in-flight commandlist
				*in_flight_views = view->next;
				BB_SLL_PUSH(local_view_free, view);
			}
			else
			{
				in_flight_views = &view->next;
			}
		}

		if (local_view_free)
		{
			//jank, find better way to do this.
			UploadBufferView* local_view_end = local_view_free;
			while (local_view_end->next != nullptr)
			{
				local_view_end = local_view_end->next;
			}
			local_view_end->next = m_free_views;
			m_free_views = local_view_free;
		}
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

private:
	RBuffer m_upload_buffer;			  //8
	void* m_upload_mem_start;			  //16

	const uint32_t m_upload_view_count;	  //24
	UploadBufferView* m_views;			  //32
	UploadBufferView* m_free_views;		  //40
	UploadBufferView* m_in_flight_views;  //48
	BBRWLock m_in_flight_lock;		      //56
	BBRWLock m_lock;					  //64

	//this fence should be send to all execute commandlists when they include a upload buffer from here.
	RFence m_fence;						  //72
	volatile uint64_t m_next_fence_value; //80
	uint64_t m_last_completed_fence_value;//88
};

//get one pool per thread
class CommandPool
{
	friend class RenderQueue;
	uint32_t m_list_count; //4 
	uint32_t m_list_current_free; //8
	RCommandList* m_lists; //16
	uint64_t m_fence_value; //24
	RCommandPool m_api_cmd_pool; //32
	CommandPool* next; //40 
	bool m_recording; //44
	BB_PAD(4); //48
public:
	RCommandList StartCommandList(const char* a_name = nullptr)
	{
		BB_ASSERT(m_recording == false, "already recording a commandlist from this commandpool!");
		BB_ASSERT(m_list_current_free < m_list_count, "command pool out of lists!");
		RCommandList list{ m_lists[m_list_current_free++] };
		Vulkan::StartCommandList(list, a_name);
		m_recording = true;
		return list;
	}

	void EndCommandList(RCommandList a_list)
	{
		BB_ASSERT(m_recording == true, "trying to end a commandlist while the pool is not recording any list");
		BB_ASSERT(a_list == m_lists[m_list_current_free - 1], "commandlist that was submitted is not from this pool or was already closed!");
		Vulkan::EndCommandList(a_list);
		m_recording = false;
	}
	void ResetPool()
	{
		BB_ASSERT(m_recording == false, "trying to reset a pool while still recording");
		Vulkan::ResetCommandPool(m_api_cmd_pool);
		m_list_current_free = 0;
	}
};

//THREAD SAFE: TRUE
class RenderQueue
{
public:

	RenderQueue(Allocator a_system_allocator, const QUEUE_TYPE a_queue_type, const char* a_name, const uint32_t a_command_pool_count, const uint32_t a_command_lists_per_pool)
		:	m_pool_count(a_command_pool_count)
	{
		m_queue_type = a_queue_type;
		m_queue = Vulkan::GetQueue(a_queue_type, a_name);
		m_fence.fence = Vulkan::CreateFence(0, "make_it_queue_name_sam!!!");
		m_fence.last_complete_value = 0;
		m_fence.next_fence_value = 1;

		m_pools = BBnewArr(a_system_allocator, a_command_pool_count, CommandPool);
		for (uint32_t i = 0; i < a_command_pool_count; i++)
		{
			m_pools[i].m_recording = false;
			m_pools[i].m_fence_value = 0;
			m_pools[i].m_list_count = a_command_lists_per_pool;
			m_pools[i].m_list_current_free = 0;
			m_pools[i].m_lists = BBnewArr(a_system_allocator, m_pools[i].m_list_count, RCommandList);
			Vulkan::CreateCommandPool(a_queue_type, a_command_lists_per_pool, m_pools[i].m_api_cmd_pool, m_pools[i].m_lists);
		}

		for (uint32_t i = 0; i < a_command_pool_count - 1; i++)
		{
			m_pools[i].next = &m_pools[i + 1];
		}

		m_pools[a_command_pool_count - 1].next = nullptr;
		m_free_pools = &m_pools[0];
		m_lock = OSCreateRWLock();
		m_in_flight_lock = OSCreateRWLock();
	}
	~RenderQueue()
	{
		WaitIdle();
		Vulkan::FreeFence(m_fence.fence);
		for (uint32_t i = 0; i < m_pool_count; i++)
		{
			Vulkan::FreeCommandPool(m_pools[i].m_api_cmd_pool);
		}
	}

	CommandPool* GetCommandPool(const char* a_pool_name = "")
	{
		OSAcquireSRWLockWrite(&m_lock);
		BB_ASSERT(m_free_pools, "pool is a nullptr, no more pools left!");
		CommandPool* pool = BB_SLL_POP(m_free_pools);
		OSReleaseSRWLockWrite(&m_lock);
		return pool;
	}

	void ReturnPool(CommandPool* a_pool)
	{
		OSAcquireSRWLockWrite(&m_in_flight_lock);
		a_pool->m_fence_value = m_fence.next_fence_value;
		BB_SLL_PUSH(m_in_flight_pools, a_pool);
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void ExecutePresentCommands(RCommandList* a_lists, const uint32_t a_list_count, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count, const uint32_t a_backbuffer_index)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");
		
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = a_list_count;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		Vulkan::ExecutePresentCommandList(m_queue, execute_info, a_backbuffer_index);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
	}

	void ExecutePresentCommands(RCommandList* a_lists, const RFence* const a_signal_fences, const uint64_t* const a_signal_values, const uint32_t a_signal_count, const RFence* const a_wait_fences, const uint64_t* const a_wait_values, const uint32_t a_wait_count, const uint32_t a_backbuffer_index)
	{
		BB_ASSERT(m_queue_type == QUEUE_TYPE::GRAPHICS, "calling a present commands on a non-graphics command queue is not valid");
		
		const uint32_t signal_fence_count = 1 + a_signal_count;
		RFence* signal_fences = BBstackAlloc(signal_fence_count, RFence);
		uint64_t* signal_values = BBstackAlloc(signal_fence_count, uint64_t);
		Memory::Copy(signal_fences, a_signal_fences, a_signal_count);
		signal_fences[a_signal_count] = m_fence.fence;
		Memory::Copy(signal_values, a_signal_values, a_signal_count);
		signal_values[a_signal_count] = m_fence.next_fence_value;

		ExecuteCommandsInfo execute_info;
		execute_info.lists = a_lists;
		execute_info.list_count = 1;
		execute_info.signal_fences = signal_fences;
		execute_info.signal_values = signal_values;
		execute_info.signal_count = signal_fence_count;
		execute_info.wait_fences = a_wait_fences;
		execute_info.wait_values = a_wait_values;
		execute_info.wait_count = a_wait_count;

		OSAcquireSRWLockWrite(&m_lock);
		Vulkan::ExecutePresentCommandList(m_queue, execute_info, a_backbuffer_index);
		++m_fence.next_fence_value;
		OSReleaseSRWLockWrite(&m_lock);
	}

	//void ExecutePresentCommands(CommandList* a_CommandLists, const uint32_t a_CommandListCount, const RenderFence* a_WaitFences, const RENDER_PIPELINE_STAGE* a_WaitStages, const uint32_t a_FenceCount);
	void WaitFenceValue(const uint64_t a_fence_value)
	{
		CommandPool* local_list_free = nullptr;

		//lock as a write can be attempetd in m_in_flight_pools.

		Vulkan::WaitFence(m_fence.fence, a_fence_value);

		OSAcquireSRWLockWrite(&m_in_flight_lock);
		//Thank you Descent Raytracer teammates great code that I can steal
		for (CommandPool** in_flight_command_polls = &m_in_flight_pools; *in_flight_command_polls;)
		{
			CommandPool* command_pool = *in_flight_command_polls;

			if (command_pool->m_fence_value <= a_fence_value)
			{
				command_pool->ResetPool();

				//Get next in-flight commandlist
				*in_flight_command_polls = command_pool->next;
				BB_SLL_PUSH(local_list_free, command_pool);
			}
			else
			{
				in_flight_command_polls = &command_pool->next;
			}
		}

		if (local_list_free)
		{
			//jank, find better way to do this.
			CommandPool* local_list_end = local_list_free;
			while (local_list_end->next != nullptr)
			{
				local_list_end = local_list_end->next;
			}
			local_list_end->next = m_free_pools;
			m_free_pools = local_list_free;
		}
		OSReleaseSRWLockWrite(&m_in_flight_lock);
	}

	void WaitIdle()
	{
		WaitFenceValue(m_fence.next_fence_value - 1);
	}

	RenderFence GetFence() const { return m_fence; }
	uint64_t GetNextFenceValue() const { return m_fence.next_fence_value; }
	uint64_t GetLastCompletedValue() const { return m_fence.last_complete_value; }

private:
	QUEUE_TYPE m_queue_type; //4
	BBRWLock m_lock; //12
	const uint32_t m_pool_count; //16
	CommandPool* m_pools; //24
	CommandPool* m_free_pools; //32 
	CommandPool* m_in_flight_pools = nullptr; //40
	BBRWLock m_in_flight_lock; //48

	RQueue m_queue;//56 
	RenderFence m_fence; //80
};

struct Mesh
{
	BufferView vertex_buffer;
	BufferView index_buffer;
};

struct DrawList
{
	MeshHandle* mesh;
	float4x4* matrix;
};

constexpr uint32_t UPLOAD_BUFFER_POOL_SIZE = mbSize * 8;
constexpr uint32_t UPLOAD_BUFFER_POOL_COUNT = 8;

struct RenderInterface_inst
{
	RenderInterface_inst(Allocator a_system_allocator)
		: graphics_queue(a_system_allocator, QUEUE_TYPE::GRAPHICS, "graphics queue", 8, 8),
		  upload_buffers(a_system_allocator, UPLOAD_BUFFER_POOL_SIZE, UPLOAD_BUFFER_POOL_COUNT)
	{}

	WindowHandle swapchain_window;
	uint32_t swapchain_width;
	uint32_t swapchain_height;
	bool debug;

	ShaderCompiler shader_compiler;

	struct VertexBuffer
	{
		RBuffer buffer;
		uint32_t size;
		uint32_t used;
		DescriptorAllocation descriptor_allocation;
	} vertex_buffer;
	struct IndexBuffer
	{
		RBuffer buffer;
		uint32_t size;
		uint32_t used;
	} index_buffer;

	uint32_t backbuffer_count;
	uint32_t backbuffer_pos;
	struct Frame
	{
		struct UniformBuffer
		{
